
# **Data Cleaning Using Pandas**

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# **1.**

In [4]:
df['FlightNumber'][1]=10055
df['FlightNumber'][3]=10075

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [5]:
df['FlightNumber']=df['FlightNumber'].apply(int)

In [6]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

# **2.**

In [7]:
df2=pd.DataFrame()

In [8]:
df2['From']=df.From_To.apply(lambda x: x.split(sep='_')[0])

In [9]:
df2['To']=df.From_To.apply(lambda x: x.split(sep='_')[1])

In [10]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [11]:
df2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# **3.**

In [12]:
df2['To']=df2['To'].apply(lambda x : x.lower().capitalize())

In [13]:
df2['From']=df2['From'].apply(lambda x : x.lower().capitalize())

In [14]:
df2

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# **4.**

In [15]:
df.drop('From_To',axis=1,inplace=True)

In [16]:
df3=pd.concat([df,df2],axis=1)

In [17]:
df3

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# **5.**

In [18]:
delays=pd.DataFrame()

In [19]:
delays['Delay1']=df3['RecentDelays'].apply(lambda x: x[0] if len(x)!=0 else np.nan)

In [20]:
delays['Delay2']=df3['RecentDelays'].apply(lambda x: x[1] if len(x)>1 else np.nan)

In [21]:
delays['Delay3']=df3['RecentDelays'].apply(lambda x: x[2] if len(x)>2 else np.nan)

In [22]:
delays

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [23]:
 df3.drop('RecentDelays',axis=1,inplace=True)

In [24]:
df4=pd.concat([df3,delays], axis=1)

In [25]:
df4

   FlightNumber              Airline      From  ... Delay1  Delay2  Delay3
0         10045               KLM(!)    London  ...   23.0    47.0     NaN
1         10055    <Air France> (12)    Madrid  ...    NaN     NaN     NaN
2         10065  (British Airways. )    London  ...   24.0    43.0    87.0
3         10075       12. Air France  Budapest  ...   13.0     NaN     NaN
4         10085          "Swiss Air"  Brussels  ...   67.0    32.0     NaN

[5 rows x 7 columns]